{
  "content": [
    {
      "type": "Page",
      "link": "/memory-in-pixel-lcds-product",
      "header": "Memory in Pixel LCDs",
      "content": "Memory in Pixel LCDs Sharp's Memory-in-Pixel LCDs are the perfect solution for compact handheld, wearable, and other small-screen applications that require a battery. Embedded, 1-bit memory in every pixel allows for an always-on display capable of delivering high-contrast, high-resolution content with ultra-low power consumption. Reflective mode leverages ambient light to eliminate the need for a backlight. Our lightweight design includes the display driver circuits integrated into the panel, yielding an exceptionally thin display module. Incorporating the Memory LCD into a design is simple with 3-wire SPI serial interface (SI, SCS, SCK). Choose from multiple sizes in 64-color, plus monochrome. Learn more about our Memory LCD technology ."
    },
    {
      "type": "Page",
      "link": "/reflective-igzo-displays-product",
      "header": "Reflective IGZO",
      "content": "Reflective IGZO Displays Sharp’s latest IGZO-based innovation brings unbeatable solutions for sunlight viewability in handheld technology, smart and battery-operated signage, and other applications. Reflective IGZO is the new gold standard in ultra-low power, sunlight-readable, full-color displays. Learn more about IGZO technology here . 1 Ultra-low Power Consumption IGZO driving low refresh rates + no backlight in reflective mode 2 High Outdoor Readability w/Full-color Moving Images @60Hz Reflective electrode structure + high contrast 3 Thin and lightweight Eliminates backlight for ease of design Our current R-IGZO line-up includes: 5-inch module for handheld and small-screen products 31.5-inch module for monitor and signage applications"
    },
    {
      "type": "Page",
      "link": "/igzo-8k-displays-product",
      "header": "IGZO 8K High-Definition Displays",
      "content": "IGZO 8K Displays High color reproduction and ultra-fine detail delivers a display perfect for mission-critical viewability. When your application relies on images that are crystal clear down to the most minute detail, 8K resolution displays built on Sharp’s signature IGZO technology deliver the goods. They’re perfect for application ranging from 3D to medical to military to broadcast and more. 1 8K Quality 280 ppi @ 31.5-inches 2 HDR Supported Direct 512 division / 100x contrast improvement 3 Superb Color Reproduction Adobe RGB 100% / sRGB 100% / DCI-P3 98%"
    },
    {
      "type": "Page",
      "link": "/industrial-lcds-product",
      "header": "Industrial LCDs",
      "content": "Industrial LCDs Whether you are looking for an industrial TFT LCD from our stock line-up, a display with premium out-of-the-box performance under Sharp warranty, or a specialized multi-touch PCAP or High-Brightness value-added solution, we have the display to meet your needs. Plus, our deep engineering resources and U.S.-based technical support give you the boost you need to get to market quickly."
    },
    {
      "type": "Page",
      "link": "/custom-camera-modules-product",
      "header": "Custom Camera Modules",
      "content": "Custom Camera Modules The world’s eyes are on Sharp’s custom camera solutions. As a leading global producer of camera modules, we partner with the world’s top brands to continually raise the bar on imaging technology across the hottest consumer product categories. Consider us as your expert go-to provider for these high-volume applications: 1 Smartphones 2 Wearable Devices/HMD 3 PC/Tablets 4 Other cutting-edge consumer electronics Sharp-Product-Custom-Camera-Modules SHARP Logo The Sharp Advantage Our engineering team offers fresh approaches to solve your unique design challenges...helping you develop your industry’s most groundbreaking products. Our compact, space-saving modules further ease your design process. Other advantages: 1 Advanced focus technology (OIS, multi-lens, folded lens) 2 Market-leading package sizes (low z-height, mdall x/y size) 3 High-yield, high-precision manufacturing processes with large-scale capacity 4 Global support capability 5 Solutions developed for the world’s most innovative product manufacturers"
    },
    {
      "type": "Page",
      "link": "/memory-in-pixel-lcds-technology",
      "header": "Memory-in-Pixel LCD Technology",
      "content": "Memory-in-Pixel LCD Technology High Resolution. Long Battery Life. Thin, Lightweight Design. The Memory-in-Pixel LCD combines matrix technology with a one-bit memory circuit embedded into every pixel, so information is retained once it's written. This allows the design of products with ultra-low power consumption and long battery life. It also delivers higher resolution, shock, and temperature tolerance than E-Ink (electronic paper) displays. Memory LCD Banner Key Sharp Memory-in-Pixel Features 1 Ultra Low Power Consumption Microwatt range (Typ.) 2 High Readability Viewable in any light, from edge-of-vision to brightest sunlight Reflective, plus Transflective models 3 Simple Interface Single 5V or 3.3V supply 3-wire SPI interface 4 Wide/Symmetrical Viewing Angle Typically 120° × 120° Ultra-low Power Consumption Sharp-Technology-MIP-Power-Consumption Requires just 1/40 ～ 1/80 of an STN LCD’s power consumption and 1/1000 of an AM-TFT LCD’s power consumption. Excellent reflective display performance without the need for a backlight. Embedded pixel memory stores graphic data, so continuous refresh is not required for a still image. Less power is needed during refresh than with traditional graphic displays. Data Memory in Each Pixel Sharp-Technology-MIP-Power-Consumption Embedded driver and peripheral circuits are monolithic on the TFT glass. Each pixel contains 1-bit memory. Fast Image Refresh Time Sharp-Technology-MIP-Power-Consumption MIP LCDs have fast response times for scrolling text and moving images. Cholesteric, STN, and E-Ink displays require longer times to update the display image (several hundred milliseconds). Simple 3-Wire Interface Sharp-Technology-MIP-Power-Consumption Simple 3-wire Serial I/F connectivity (SI, SCS, SCLK) Only a single 3 V (1.28” and smaller) or 5 V (1.8” and larger) power supply is required Only 3 external capacitors are required Fewer peripheral components = simplified design process"
    },
    {
      "type": "Page",
      "link": "/reflective-igzo-technology",
      "header": "Reflective IGZO Technology",
      "content": "Reflective IGZO Technology Reflective IGZO technology yields full-color reflective, outdoor readable, low-power displays built on Sharp’s signature IGZO-TFT technology . It’s the perfect solution when good outdoor readability and battery operation is required. 1 Ultra-low Power Consumption IGZO driving low refresh rates + no backlight in reflective mode 2 High Outdoor Readability w/Full-color Moving Images @60Hz Reflective electrode structure + high contrast 3 Thin and lightweight Eliminates backlight for ease of design Sharp-Technology-R-IGZO *The photos are orginial, unedited without a frontlight or backlight Full Color + Moving Images Sharp has combined MVA LC mode and silver alloy reflective MRS in order to achieve high reflectance, high contrast ratio, and high NTSC ratio. Employing IGZO-TFT technology alongside a reflective electrode structure enables flicker-less drive at 1Hz. Sharp Technology R IGZO Ultra-low Power Consumption IGZO has low off-leakage current for the I-V characteristic. This enables an industry-leading combination of low-frequency driving, and 8-bit RGB color in a reflective display. Driving frequency switches to 60Hz when displaying moving images and 1Hz when displaying still images. In Figure B, voltage is applied to the TFT elements of each pixel for one frame in 60 at 1Hz drive. In the remaining 59 frames, the driver IC and the driving circuit of LC panel are almost off."
    },
    {
      "type": "Page",
      "link": "/igzo-technology",
      "header": "IGZO Technology",
      "content": "IGZO Technology A Breakthrough in Display Performance Revolutionary IGZO display technology delivers high-resolution, ultra-low power, slim product profiles, and exceptionally detailed touch panel capabilities. IGZO is a driving force behind new developments in a variety of fields, enabling reflective displays, as well as OLED, MEMS, and other display technologies with new levels of performance. 1 Ultra-low Power Consumption IGZO driving at 1Hz refresh 2 Enables higher resolution using a-Si processes Improved display light transmission or reflectivity 3 Enables low-noise PCAP touchscreen implementations Able to sync PCAP controller with the LCD drive. Sharp Technology R IGZO High Mobility Rates Composed of Indium, Gallium, Zinc, and Oxide, IGZO moves beyond traditional TFT LCD technology with electron mobility far higher than Amorphous Silicon (a-Si) displays. Sharp Technology IGZO Mobility Exceptionally High Resolution High electron mobility rate of IGZO successfully enables unprecedented transistor miniaturization and circuit thinning. By raising the light transmission of each pixel, twice the resolution is achieved for the same transmittance. Sharp Technology IGZO High Resolution Ultra-low Power Consumption IGZO’s Pause Driving Method capitalizes on High OFF Resistance. Utilizing this improved pixel performance, IGZO reduces power consumption to one-fifth or even one-tenth that of conventional screens, which contributes to longer product battery life. Sharp Technology IGZO Power Consumption Responsive Touch Panel Performance IGZO can be an intermittently operated semiconductor, allowing the LCD drive to be OFF during the touch panel sensing cycle. This enables detecting even the faintest signals for highly accurate PCAP (Projected Capacitive) touch and pen input."
    },
    {
      "type": "Page",
      "link": "/",
      "header": "Home",
      "content": "Make Your Product Shine with Our Reflective, Low-Power, Sunlight Viewable Displays Sharp wrote the book when it comes to displays that perform in the most challenging environments. Today, there are endless applications for displays that can stand up to extreme lighting conditions or the need to render mission-critical detail.Our line-up includes the best in Sharp reflective technology, from our Memory-in-Pixel LCDs to new Reflective IGZO display modules that enable thin, lightweight products with ultra-low power requirements. And we continue to offer some of the toughest Industrial LCD specifications in the industry. Memory-in-Pixel LCDs Our Memory-in-Pixel displays offer best-of-class performance with ultra-low power consumption and high readability in almost any ambient lighting environment. Choose from eye-catching 64-color or high-contrast monochrome for designs ranging from wearables to medical devices to smart meters and many more. Memory in pixel LCD Reflective IGZO Our full-color, low-power Reflective IGZO displays are the latest advancement built on Sharp’s IGZO-TFT technology. They’re the perfect solution for battery-operated handheld and outdoor applications where fantastic readability is required. Reflect IGZO 8K Displays Our ultra-high-definition 8K displays deliver an unparalleled viewing experience with 3D-like feeling, depth, and high-resolution detail. See our 31.5-inch 8K display, which delivers some of the world’s highest quality with the combination of 8K + HDR + 120Hz drive options built on Sharp IGZO. 8k Displays Industrial LCDs Whether it’s all-Sharp out of the box or a high-performance solution by a Sharp value-add partner, we work with you and the industry’s best talent to find the perfect Industrial LCD module for your project. We deliver multi-touch PCAP, high-brightness, high-contrast, wide viewing angles, and wide operating temperatures for performance in the most challenging environments."
    },
    {
      "type": "Page",
      "link": "/contact",
      "header": "Contact Us",
      "content": "Contact our experts"
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LS032B3SX02",
      "content": "LS032B3SX02 This 3.15-inch Chip-on-Glass (COG), full in-cell touch panel with integrated cover glass, features a high contrast of 1000:1 paired with 630 nits of brightness for dazzling performance in high-bright ambient conditions. Color is rendered at 69% NTSC ratio to deliver additional richness for both still and video content. The MIPI interface industrial display also features wide viewing angles for excellent viewability in a variety of environments."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ064X3LW02",
      "content": "LQ064X3LW02 This 6.4-inch (diagonal) XGA display delivers a 800:1 contrast ratio and 350 nits of brightness. It is ideal for use in test and measurement applications where a high-resolution display is required, medical applications, and a number of additional industrial applications. The panel features a dot pitch of 0.12675 and an LVDS interface."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ070Y3LG05",
      "content": "LQ070Y3LG05 This 15:9 aspect WVGA module features an LVDS interface, fast response time of 16 ms, an LED backlight (with built-in driver), and brightness and contrast ratings of 350 nits and 500:1, respectively. The module also incorporates anti-glare and 3H hard coatings."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ084S3LG03",
      "content": "LQ084S3LG03 This module features a 50,000-hr rated backlight, extended operating and storage temperature ranges, plus shock and vibration resistance."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ084S3LG11",
      "content": "LQ084S3LG11 This 8.4-inch (diagonal) SVGA display delivers a 600:1 contrast ratio and 400 nits of brightness. It is ideal for use in test and measurement applications where a high-resolution display is required, medical applications, and a number of additional industrial applications. The display has an LVDS interface."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ104S1LG75",
      "content": "LQ104S1LG75 This high-performance 10.4-inch (diagonal) SVGA TFT display is optimized to perform in extreme industrial environments such as agriculture, marine navigation, and others. It delivers 1100 nits of brightness out of the box for superb viewability in high ambient light conditions and includes a built-in LED backlight driver. The display is readable while wearing polarized sunglasses."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ104S1LG81",
      "content": "LQ104S1LG81 This 4:3 aspect SVGA Module features a 50,000-hr LED backlight (built-in driver), LVDS interface, extended temperature capability, shock and vibration resistance, and 3H hard coating."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ104V1DG74",
      "content": "LQ104V1DG74 This 10.4-inch TFT LCD module has a wide high- and low-temperature operation range and high contrast of 800:1, making it ideal for industrial applications."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ104V1DG81",
      "content": "LQ104V1DG81 This module features a 50,000-hr rated backlight with a built-in driver. An LVDS interface version of this module is also available, see LQ104V1LG81. For Specifications, see your local Sharp Representative."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ104V1LG81",
      "content": "LQ104V1LG81 This module with high contrast features a 50,000-hr rated backlight, extended temperature, shock, and vibration ratings; built-in backlight driver. An LVDS interface version is also available, see: LQ104V1LG81. For Specifications, see your local Sharp Representative."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ121K1LG52",
      "content": "LQ121K1LG52 This 16:10 aspect ratio module features 50,000-hr backlight and built-in backlight driver circuitry."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ121K1LG58",
      "content": "LQ121K1LG58 This 16:10 aspect ratio WXGA LCD module features high brightness and contrast, 70% NTSC ratio, extended temperature operations, a 50,000 hr. backlight, and built-in LED driver circuitry."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ121S1LG88",
      "content": "LQ121S1LG88 This 12.1-inch Sharp SVGA TFT LCD features an LVDS interface, 450 nits of brightness, and a high 800:1 contrast ratio for excellent viewability in tough ambient lighting conditions. The module includes a built-in LED Driver for ease of design. "
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ150X1LW95",
      "content": "LQ150X1LW95 This TFT LCD panel from Sharp features a high contrast ratio of 1500:1 and brightness of 400 nits. It also boasts wide viewing angles for added viewability. It has an LVDS interface and a built-in LED driver for ease of design."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ150X1LW96",
      "content": "LQ150X1LW96 This 15.0-inch LCD display module features an exceptionally high 1500:1 contrast ratio. A brightness of 500 nits and a wide viewing angle further add to the panel's viewability in tough environments."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ150X1LX83",
      "content": "LQ150X1LX83 This LCD module features an extremely high contrast of 1500:1 for viewability in extreme environments. It also renders color at 70% NTSC. A built-in LED driver is included."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ150X1LX95",
      "content": "LQ150X1LX95 This Normally Black 4:3 aspect XGA module, features extremely high contrast, extremely wide symmetrical viewing cone, 70% NTSC colorimetry, LVDS interface, and a white LED backlight which carries a 50,000 hour lifetime rating. It also has an anti-glare and 3H hard coating."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ150X1LX96",
      "content": "LQ150X1LX96 This Normally Black 4:3 aspect XGA module features extremely high contrast, extremely wide symmetrical viewing cone, 70% NTSC colorimetry, LVDS interface, and a white LED backlight which carries a 50,000 hour lifetime rating. It also has an anti-glare and 3H hard coating."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ156T3LW03",
      "content": "LQ156T3LW03 This 15.6-inch display combines a bright LED backlight with color filtering to render 76% NTSC. This results in bright, vivid images that are ideal for multi-media applications. The LCD also features wide viewing angles."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ156T3LW05",
      "content": "LQ156T3LW05 This LCD display module features a bright 400-nit backlight and high color rendering at 76% NTSC. It is ideal for multimedia applications and viewing at wide angles. High contrast of 1000:1 further expands the module's viewability and performance."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ190E1LW72",
      "content": "LQ190E1LW72 This LCD module features an extremely high contrast of 1500:1, complemented with 350 nits of brightness, for viewability in extreme environments. A built-in LED driver is included."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ190E1LX75T",
      "content": "LQ190E1LX75T This Normally Black 5:4 aspect SXGA module, features extremely high contrast, extremely wide symmetrical viewing cone, an LVDS interface, and a white LED backlight which carries a 70,000 hour lifetime rating. It also has an anti-glare and 3H hard coating."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ190E1LX76",
      "content": "LQ190E1LX76 This SXGA TFT LDC panel features high contrast of 1500:1 and 470 nits of brightness to render extremely crisp images. It is ideal for viewability in challenging lighting conditions."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS011B7DH03",
      "content": "LS011B7DH03 Sharp’s 1.08-inch (diagonal) Memory-in-Pixel LCD delivers 16.5% reflectivity, making it a perfect display for use in wrist-top applications that require excellent viewability in bright ambient light environments. The monochrome module’s ultra-low-power operation makes it ideal for products that require a battery."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS012B7DD06A",
      "content": "LS012B7DD06A This 64-color Memory-in-Pixel LCD module is ideal for wrist-top or handheld applications or virtually any design that requires extremely low power consumption. It delivers smooth graphics in a popular shape, along with the flexibility to support rich custom content."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS013B7DD02",
      "content": "LS013B7DD02 This round 1.29-inch (diagonal) Memory-in-Pixel LCD renders 64 colors with an 18% NTSC ratio. This combines with a 25:1 contrast ratio to deliver high-quality images–static or moving–in a variety of lighting environments. The module’s reflective mode and ultra-low-power requirements make it perfect for wrist-top applications that require a battery."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS013B7DH03",
      "content": "LS013B7DH03 This highly-relfiective plus Transmissive Memory LCD has 18% Reflectivity, 0.2% Transmissivity, and super-low-power-consumption."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS013B7DH05",
      "content": "LS013B7DH05 This 1.26-inch (diagonal), slightly transmissive display delivers smooth graphics with the flexibility to support rich content. 1 bit of internal memory for data storage inside the panel results in extremely low power consumption (35 µW typical in a static state). This makes the display perfect for small-screen applications where power-saving is a must."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS014B7DD01",
      "content": "LS014B7DD01 This round 1.39-inch (diagonal) Memory-in-Pixel LCD renders 64 colors with an 18% NTSC ratio. This combines with a 25:1 contrast ratio to deliver high-quality images–static or moving–in a variety of lighting environments. The module’s reflective mode and ultra-low-power requirements make it perfect for wrist-top applications that require a battery."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS018B7DH02",
      "content": "LS018B7DH02 Sharp’s Memory-in-Pixel LCDs deliver high performance with ultra-low power operation. This monochrome 1.80-inch module features a reflectivity of 15.5% and a contrast ratio of 25:1, making it ideal for viewing in bright sunlight."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS021B7DD02",
      "content": "LS021B7DD02 This Sharp Memory-in-Pixel LCD delivers static or moving images in 64 colors, making it perfect for a variety of wrist-top and handheld products. The TFT-module’s reflective mode and ultra-low-power requirements make it perfect for wrist-top applications that require a battery."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS027B7DH01A",
      "content": "LS027B7DH01A This HR-TFT Transflective model is Sharp's first Transflective Memory LCD. Add a backlight with this display for excellent viewing in dark ambient conditions."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS032B7DD02",
      "content": "LS032B7DD02 This Transflective panel features an FPC connector. Add a backlight with this display for excellent viewing in all ambients."
    },
    {
      "type": "Product",
      "link": "/memory-in-pixel-lcds-product",
      "header": "LS044Q7DH01",
      "content": "LS044Q7DH01 This Transflective monochrome panel features QVGA resolution and is ideal for applications such as Industrial Controls, as well as most other battery-operated devices that require an LCD with Landscape orientation. Its dot matrix display delivers smooth graphics and the flexibility to showcase rich custom content."
    },
    {
      "type": "Product",
      "link": "/reflective-igzo-displays-product",
      "header": "31.5-inch module",
      "content": "LS315M7JX01 This 31.5-inch (diagonal) reflective display brings all the power of Sharp IGZO to your designs. It’s perfect for outdoor viewability in products such as battery-powered signage, and other high ambient light applications that require low power operation. The display offers ultra-low power consumption for both still and motion images, and a low-power refresh rate without flicker. It features full color with a 28% NTSC ratio, and its wide viewing angles combine with high contrast for vivid images. It also delivers industrial strength operating temperature ranges."
    },
    {
      "type": "Product",
      "link": "/reflective-igzo-displays-product",
      "header": "5-inch module",
      "content": "This 5.0-inch (diagonal) Reflective IGZO portrait-mode display is ideal for battery-powered, handheld products that require full-color and high-resolution performance in bright outdoor environments. The panel, built on Sharp’s industry-leading IGZO technology, offers ultra-low power consumption for both still and motion images, and allows for slim product profiles with reduced thermal management requirements. The MIPI interface display also delivers industrial strength operating temperature ranges."
    },
    {
      "type": "Product",
      "link": "/industrial-lcds-product",
      "header": "LQ080Y3LW01A",
      "content": "LQ080Y3LW01A This WVGA (800 × 480) automotive-grade display features 650 nits of brightness and 1800:1 contrast ratio, right out of the box, for use in high-performance industrial products. The display is perfect for viewability in the toughest environments, and high ambient light applications. The module also features an extended temperature range and a 50,000-hour LED backlight."
    },
    {
      "type": "Page",
      "link": "/news",
      "header": "Sharp SECD News",
      "content": "Visit this page for the latest product and technology news from Sharp SECD.For media inquiries, please contact: Karamy Muessig, Xposure Unlimited Karamy@XposureUnlimited.com Memory LCD Banner Sharp’s New R-IGZO 5-inch Display Sets Standard for Sunlight Viewability with Low-Power July 15, 2021 Today, Sharp Electronics Corporation Device Division (SECD) unveiled its new Reflective IGZO (R-IGZO) 5-inch (diagonal) display for handheld applications. This latest IGZO-based innovation brings an unbeatable solution for sunlight viewability in handheld technology with incredibly low power consumption. Samples are available now, with mass production starting in July 2021."
    }
  ]
}
